/* automatically generated by rust-bindgen 0.71.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC2X: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 35;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;

pub const SCNoLEAST64: &[u8; 3] = b"lo\0";
pub const SCNoFAST8: &[u8; 4] = b"hho\0";
pub const SCNoFAST16: &[u8; 3] = b"lo\0";
pub const SCNoFAST32: &[u8; 3] = b"lo\0";
pub const SCNoFAST64: &[u8; 3] = b"lo\0";
pub const SCNx8: &[u8; 4] = b"hhx\0";
pub const SCNx16: &[u8; 3] = b"hx\0";
pub const SCNx32: &[u8; 2] = b"x\0";
pub const SCNx64: &[u8; 3] = b"lx\0";
pub const SCNxLEAST8: &[u8; 4] = b"hhx\0";
pub const SCNxLEAST16: &[u8; 3] = b"hx\0";
pub const SCNxLEAST32: &[u8; 2] = b"x\0";
pub const SCNxLEAST64: &[u8; 3] = b"lx\0";
pub const SCNxFAST8: &[u8; 4] = b"hhx\0";
pub const SCNxFAST16: &[u8; 3] = b"lx\0";
pub const SCNxFAST32: &[u8; 3] = b"lx\0";
pub const SCNxFAST64: &[u8; 3] = b"lx\0";
pub const SCNdMAX: &[u8; 3] = b"ld\0";
pub const SCNiMAX: &[u8; 3] = b"li\0";
pub const SCNoMAX: &[u8; 3] = b"lo\0";
pub const SCNuMAX: &[u8; 3] = b"lu\0";
pub const SCNxMAX: &[u8; 3] = b"lx\0";
pub const SCNdPTR: &[u8; 3] = b"ld\0";
pub const SCNiPTR: &[u8; 3] = b"li\0";
pub const SCNoPTR: &[u8; 3] = b"lo\0";
pub const SCNuPTR: &[u8; 3] = b"lu\0";
pub const SCNxPTR: &[u8; 3] = b"lx\0";
pub const CMAKE_BUILD_TYPE: &[u8; 8] = b"Release\0";
pub const HIGHS_GITHASH: &[u8; 10] = b"2584a4d6b\0";
pub const HIGHS_VERSION_MAJOR: u32 = 1;
pub const HIGHS_VERSION_MINOR: u32 = 11;
pub const HIGHS_VERSION_PATCH: u32 = 0;
pub const HIGHSINT_FORMAT: &[u8; 2] = b"d\0";
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type __gwchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct imaxdiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of imaxdiv_t"][::std::mem::size_of::<imaxdiv_t>() - 16usize];
    ["Alignment of imaxdiv_t"][::std::mem::align_of::<imaxdiv_t>() - 8usize];
    ["Offset of field: imaxdiv_t::quot"][::std::mem::offset_of!(imaxdiv_t, quot) - 0usize];
    ["Offset of field: imaxdiv_t::rem"][::std::mem::offset_of!(imaxdiv_t, rem) - 8usize];
};
unsafe extern "C" {
    pub fn imaxabs(__n: intmax_t) -> intmax_t;
}
unsafe extern "C" {
    pub fn imaxdiv(__numer: intmax_t, __denom: intmax_t) -> imaxdiv_t;
}
unsafe extern "C" {
    pub fn strtoimax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn strtoumax(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
unsafe extern "C" {
    pub fn wcstoimax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> intmax_t;
}
unsafe extern "C" {
    pub fn wcstoumax(
        __nptr: *const __gwchar_t,
        __endptr: *mut *mut __gwchar_t,
        __base: ::std::os::raw::c_int,
    ) -> uintmax_t;
}
pub type HighsInt = ::std::os::raw::c_int;
pub type HighsUInt = ::std::os::raw::c_uint;
#[doc = " Struct to handle callback output data\n"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HighsCallbackDataOut {
    pub cbdata: *mut ::std::os::raw::c_void,
    pub log_type: ::std::os::raw::c_int,
    pub running_time: f64,
    pub simplex_iteration_count: HighsInt,
    pub ipm_iteration_count: HighsInt,
    pub pdlp_iteration_count: HighsInt,
    pub objective_function_value: f64,
    pub mip_node_count: i64,
    pub mip_total_lp_iterations: i64,
    pub mip_primal_bound: f64,
    pub mip_dual_bound: f64,
    pub mip_gap: f64,
    pub mip_solution: *mut f64,
    pub mip_solution_size: HighsInt,
    pub cutpool_num_col: HighsInt,
    pub cutpool_num_cut: HighsInt,
    pub cutpool_num_nz: HighsInt,
    pub cutpool_start: *mut HighsInt,
    pub cutpool_index: *mut HighsInt,
    pub cutpool_value: *mut f64,
    pub cutpool_lower: *mut f64,
    pub cutpool_upper: *mut f64,
    pub user_solution_callback_origin: HighsInt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HighsCallbackDataOut"][::std::mem::size_of::<HighsCallbackDataOut>() - 160usize];
    ["Alignment of HighsCallbackDataOut"][::std::mem::align_of::<HighsCallbackDataOut>() - 8usize];
    ["Offset of field: HighsCallbackDataOut::cbdata"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cbdata) - 0usize];
    ["Offset of field: HighsCallbackDataOut::log_type"]
        [::std::mem::offset_of!(HighsCallbackDataOut, log_type) - 8usize];
    ["Offset of field: HighsCallbackDataOut::running_time"]
        [::std::mem::offset_of!(HighsCallbackDataOut, running_time) - 16usize];
    ["Offset of field: HighsCallbackDataOut::simplex_iteration_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, simplex_iteration_count) - 24usize];
    ["Offset of field: HighsCallbackDataOut::ipm_iteration_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, ipm_iteration_count) - 28usize];
    ["Offset of field: HighsCallbackDataOut::pdlp_iteration_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, pdlp_iteration_count) - 32usize];
    ["Offset of field: HighsCallbackDataOut::objective_function_value"]
        [::std::mem::offset_of!(HighsCallbackDataOut, objective_function_value) - 40usize];
    ["Offset of field: HighsCallbackDataOut::mip_node_count"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_node_count) - 48usize];
    ["Offset of field: HighsCallbackDataOut::mip_total_lp_iterations"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_total_lp_iterations) - 56usize];
    ["Offset of field: HighsCallbackDataOut::mip_primal_bound"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_primal_bound) - 64usize];
    ["Offset of field: HighsCallbackDataOut::mip_dual_bound"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_dual_bound) - 72usize];
    ["Offset of field: HighsCallbackDataOut::mip_gap"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_gap) - 80usize];
    ["Offset of field: HighsCallbackDataOut::mip_solution"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_solution) - 88usize];
    ["Offset of field: HighsCallbackDataOut::mip_solution_size"]
        [::std::mem::offset_of!(HighsCallbackDataOut, mip_solution_size) - 96usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_num_col"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_num_col) - 100usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_num_cut"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_num_cut) - 104usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_num_nz"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_num_nz) - 108usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_start"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_start) - 112usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_index"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_index) - 120usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_value"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_value) - 128usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_lower"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_lower) - 136usize];
    ["Offset of field: HighsCallbackDataOut::cutpool_upper"]
        [::std::mem::offset_of!(HighsCallbackDataOut, cutpool_upper) - 144usize];
    ["Offset of field: HighsCallbackDataOut::user_solution_callback_origin"]
        [::std::mem::offset_of!(HighsCallbackDataOut, user_solution_callback_origin) - 152usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct HighsCallbackDataIn {
    pub user_interrupt: ::std::os::raw::c_int,
    pub user_solution: *mut f64,
    pub cbdata: *mut ::std::os::raw::c_void,
    pub user_has_solution: ::std::os::raw::c_int,
    pub user_solution_size: HighsInt,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of HighsCallbackDataIn"][::std::mem::size_of::<HighsCallbackDataIn>() - 32usize];
    ["Alignment of HighsCallbackDataIn"][::std::mem::align_of::<HighsCallbackDataIn>() - 8usize];
    ["Offset of field: HighsCallbackDataIn::user_interrupt"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_interrupt) - 0usize];
    ["Offset of field: HighsCallbackDataIn::user_solution"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_solution) - 8usize];
    ["Offset of field: HighsCallbackDataIn::cbdata"]
        [::std::mem::offset_of!(HighsCallbackDataIn, cbdata) - 16usize];
    ["Offset of field: HighsCallbackDataIn::user_has_solution"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_has_solution) - 24usize];
    ["Offset of field: HighsCallbackDataIn::user_solution_size"]
        [::std::mem::offset_of!(HighsCallbackDataIn, user_solution_size) - 28usize];
};
pub type HighsCCallbackType = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: ::std::os::raw::c_int,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const HighsCallbackDataOut,
        arg4: *mut HighsCallbackDataIn,
        arg5: *mut ::std::os::raw::c_void,
    ),
>;
pub const kHighsMaximumStringLength: HighsInt = 512;
pub const kHighsStatusError: HighsInt = -1;
pub const kHighsStatusOk: HighsInt = 0;
pub const kHighsStatusWarning: HighsInt = 1;
pub const kHighsVarTypeContinuous: HighsInt = 0;
pub const kHighsVarTypeInteger: HighsInt = 1;
pub const kHighsVarTypeSemiContinuous: HighsInt = 2;
pub const kHighsVarTypeSemiInteger: HighsInt = 3;
pub const kHighsVarTypeImplicitInteger: HighsInt = 4;
pub const kHighsOptionTypeBool: HighsInt = 0;
pub const kHighsOptionTypeInt: HighsInt = 1;
